---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FamilyMismatchCircuit
source: html/9de8112c-21dc-122e-f9c2-89e57556c374.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.FamilyMismatchCircuit Property

The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit?

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyMismatchCircuit { get; }
```